# Titanic solution by Funny Horse

## Importing necessaty libs

In [20]:
import pandas as pd
import numpy as np
import pylab as pl
import matplotlib as mpl
import seaborn as sns
import math
%matplotlib inline
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [2]:
train = pd.read_csv("train.csv")
testing = pd.read_csv("test.csv")
testing.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

### Deleting ids, tickets and names

In [3]:
testing.drop(['Ticket', 'PassengerId', 'Name'], axis = 1, inplace = True)

In [4]:
testing.head(3)

   Survived  Pclass     Sex  Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male   22      1      0   7.2500   NaN        S
1         1       1  female   38      1      0  71.2833   C85        C
2         1       3  female   26      0      0   7.9250   NaN        S

## Replacing empty fields in string columns

In [25]:
testing["Embarked"] = testing["Embarked"].fillna("Empty")
train["Embarked"] = train["Embarked"].fillna("Empty")
testing["Cabin"] = testing["Cabin"].fillna("Empty")
train["Cabin"] = train["Cabin"].fillna("Empty")

## Convert to numbers

In [26]:
import sklearn
from sklearn.preprocessing import LabelEncoder
lbl_enc = LabelEncoder()
for c in ['Embarked', 'Sex']:
    train[c] = lbl_enc.fit_transform(train[c])
    testing[c] = lbl_enc.transform(testing[c])

In [31]:
train.drop(['Cabin'], axis=1, inplace=True)
testing.drop(['Cabin'], axis=1, inplace=True)

In [32]:
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch     Fare  Embarked
0         0       3    1   22      1      0   7.2500         3
1         1       1    0   38      1      0  71.2833         0
2         1       3    0   26      0      0   7.9250         3
3         1       1    0   35      1      0  53.1000         3
4         0       3    1   35      0      0   8.0500         3